[
  {
    "episode_number": 550,
    "title": "WPH #554: He STUNS Everyone!!!!!!",
    "url": "https://jonathanlittlepoker.com/wph-550/",
    "situation": "Lukas Robinson “RobinPoker” is a professional poker player from England. He has over $58,000 in live tournament earnings. He is known for being the first PokerNews ambassador, a role that sees him streaming online poker on Twitch. He rose to fame in 2021 when he became the first poker player to stre",
    "action_sequence": [
      "Lukas Robinson raises from the cutoff to 50,000 with A5o. After the button and small blind fold, Maria Ho defends her big blind with A4 of hearts and the two professional poker players head to the",
      "💸 Flop – Ac Ts 6d:With her suited wheel-ace, Ho flops top pair with no backdoor draws. She checks, to which Robinson fires a continuation bet of 40,000 with the same top pair. Ho decides not to raise and just calls as they head to the",
      "💣 Turn – Tc:Ho checks again when the board-pairing ten of clubs arrives on the turn. Robinson correctly realizes this card is better for Ho’s range than his, so he chooses to do some pot control and checks behind.\n🌊",
      "When you have a weak top pair and you are out of position, it’s generally not advised to start check-raising and putting a lot of money in the pot. TMost of the time, you are either way ahead and you do not need to worry about being outdrawn, or you’re way behind and have very few outs to make the w"
    ],
    "strategic_analysis": "When you have a weak top pair and you are out of position, it’s generally not advised to start check-raising and putting a lot of money in the pot. TMost of the time, you are either way ahead and you do not need to worry about being outdrawn, or you’re way behind and have very few outs to make the winning hand.",
    "key_learnings": [
      "He has what feels like a relatively easy call, but will the nerves get to him?\nWhen you have a weak top pair and you are out of position, it’s generally not advised to start check-raising and putting a lot of money in the pot"
    ],
    "position_info": "episodes, the sixteen participants competed across various poker formats, including Sit & Go’s, Head",
    "stack_sizes": "Stack sizes not specified",
    "pot_size": "Pot size not specified"
  },
  {
    "episode_number": 551,
    "title": "WPH #551: She’s The NEW QUEEN of Poker!!",
    "url": "https://jonathanlittlepoker.com/wph-551/",
    "situation": "Being a world-famous actor like Arden Cho will surely help her maintain the perfect poker face. She needed all her acting skills in this hand as she finds herself heads-up against the 17-time World Series of Poker bracelet winner, Phil Hellmuth. Cho gets all her money in with Hellmuth drawing dead o",
    "action_sequence": [
      "Arden Cho raises from the cutoff with pocket fours and Stanley calls with J4 of clubs from the small blind. Phil Hellmuth decides to 3-bet to $1,000 with KQo from the big blind. Cho calls with her sailboats as Stanley decides to fold. They go to the",
      "💸 Flop – Jh 6c 4h:Hellmuth misses the flop and is left with just two overcards and a backdoor straight draw. He continues to be the aggressor in the hand and fires a continuation bet of $1,100. It is a dream flop for Cho as she has flopped bottom set with her low pocket pair. She sets the trap and d",
      "Jonathan Little analyzes live poker hands from TV poker shows such as Poker After Dark, Hustler Casino Live, The Lodge Poker Club & PokerGO. He also analyzes popular poker vloggers such as Rampage Poker, Brad Owen, Jaman Burton, Ashley Sleeth, Wolfgang Poker and others!\nYou will also find many poker"
    ],
    "strategic_analysis": "When you decide to 3-bet from out of position, like the small blind versus a button open raise, you generally want to make your re-raise larger because you will be playing the rest of the hand from ‘out of position’ which is the worst position in poker. Being able to act last gives you much more information for you to make your decision. Raising larger also reduces the stack-to-pot ratio which then helps reduce the edge that the in position player will have as the effective stack is now shorter.",
    "key_learnings": [
      "Raising larger also reduces the stack-to-pot ratio which then helps reduce the edge that the in position player will have as the effective stack is now shorter",
      "Hustler Casino Live is a full-scale, high-value poker production",
      "She sets the trap and decides to just call to keep all of Hellmuth’s bluffs in"
    ],
    "position_info": "ep all of Hellmuth’s bluffs in.",
    "stack_sizes": "effective stack is now shorter.",
    "pot_size": "Pot size not specified"
  },
  {
    "episode_number": 552,
    "title": "WPH #552: Did Andrew Neeme Just Get OWNED????",
    "url": "https://jonathanlittlepoker.com/wph-552/",
    "situation": "#pokerstrategy #thelodgecardclub #pokervloggerAndrew Neeme is the OG when it comes to poker vlogging and his poker strategy is documented in detail throughout his popular YouTube channel. However, those poker vlogs could hurt his win rate during the Lodge Card Club live stream after he flops a boat ",
    "action_sequence": [
      "With the $20 straddle on, Kiero limps from under-the-gun+2 with pocket threes and Goob calls from the cutoff holding A8o. T1000 follows with a limp from the button, holding T7 of clubs. Andrew Neeme however, punishes the limpers by raising to $175 with his pocket queens. The small blind and big blin",
      "When you are out of position and have a very strong hand, such as top set or a full house on a wet board, this is often a good time to put in a 3-bet on the flop. When playing deep stacked poker from out of position, it is often harder to get all of the money into the middle by the",
      "T1000 whose real name is John-Christian Templeton is an American poker player who currently resides in Austin, Texas, USA. He’s a regular on The Lodge live stream primarily playing mid-stakes poker and has over $350,000 in live tournament earnings Since 2022, T1000 has played on over 72 live streame",
      "T1000 whose real name is John-Christian Templeton is an American poker player who currently resides in Austin, Texas, USA. He’s a regular on The Lodge live stream primarily playing mid-stakes poker and has over $350,000 in live tournament earnings Since 2022, T1000 has played on over 72 live streame",
      "🔍 Preflop:With the $20 straddle on, Kiero limps from under-the-gun+2 with pocket threes and Goob calls from the cutoff holding A8o",
      "The small blind and big blind fold, but Shai calls from the under-the-gun straddle with pocket fours",
      "Kiero folds his crabs, and Goob folds the “”dead man’s hand,”” but T1000 calls in position with his suited two-gapper and they head to the flop three-way",
      "Shai calls with his underpair, which is virtually drawing dead and can only win by hitting runner-runner quads",
      "Worried about the flush and straight draws on the board, he raises to $450 to protect his three tens"
    ],
    "strategic_analysis": "When you are out of position and have a very strong hand, such as top set or a full house on a wet board, this is often a good time to put in a 3-bet on the flop. When playing deep stacked poker from out of position, it is often harder to get all of the money into the middle by the river since the turn will often check through.",
    "key_learnings": [
      "So, will the poker vlogger be able to extract the maximum with the virtual nuts?\nWhen you are out of position and have a very strong hand, such as top set or a full house on a wet board, this is often a good time to put in a 3-bet on the flop",
      "When playing deep stacked poker from out of position, it is often harder to get all of the money into the middle by the river since the turn will often check through",
      "Kiero folds his crabs, and Goob folds the “”dead man’s hand,”” but T1000 calls in position with his suited two-gapper and they head to the flop three-way"
    ],
    "position_info": "ep stacked poker from out of position, it is often harder to get all of the money into the middle by",
    "stack_sizes": "Stack sizes not specified",
    "pot_size": "Pot size not specified"
  },
  {
    "episode_number": 553,
    "title": "WPH #553: Rampage Poker Is So LUCKY!!!!!!",
    "url": "https://jonathanlittlepoker.com/wph-553/",
    "situation": "Rampage Poker’s vlogging career has featured everything poker has to offer: bluffs, hero calls, hero folds, punts & more recently losing over a million dollars! This time, while playing at the Lodge Card Club during one of his vlogging sessions, Rampage records himself picking up quads in a huge thr",
    "action_sequence": [
      "With the $100 straddle on, Bart Hanson raises to $300 from under-the-gun+1. Rampage Poker 3-bets to $1,100 from UTG+2 with pocket queens and Bones cold-calls on the button with pocket jacks. Hanson also decides to call and they head to the",
      "Bart Hanson is an American professional poker player with over $1,000,000 in live tournament earnings. He primarily specializes in cash games and is the founder of Crush Live Poker, a popular training site that offers valuable content for players looking to improve their live poker game.\nCasey, a.k.",
      "💣 Turn – Qc:The board-pairing queen on the turn improves Rampage to quad queens, while Bones improves to a full house. Hanson checks and Rampage checks, likely hoping his opponents will catch up on the",
      "🌊 River – 5c:The front door straight and flush draws miss with the 5 of clubs on the river. Will Rampage manage to stack Bones with quads over a full house, or will Bones find a way to save some chips? Stay tuned until the end of this poker video to find out!\nJonathan Little analyzes live poker hand",
      "Rampage Poker’s vlogging career has featured everything poker has to offer: bluffs, hero calls, hero folds, punts & more recently losing over a million dollars! This time, while playing at the Lodge C",
      "Can Rampage find a way to extract maximum value with the nuts?\nPoker players that will often cold call 3-bets will generally have a strong but non nutted range",
      "🔍 Preflop:With the $100 straddle on, Bart Hanson raises to $300 from under-the-gun+1",
      "Rampage Poker 3-bets to $1,100 from UTG+2 with pocket queens and Bones cold-calls on the button with pocket jacks"
    ],
    "strategic_analysis": "Poker players that will often cold call 3-bets will generally have a strong but non nutted range. This includes medium to high pocket pairs, suited broadways and sometimes even ace-king. Against this type of range you should proceed cautiously on a wide variety of flops but also be aware of players that will play very passively postflop. These type of opponents will often fold at a high frequency if they do not drastically improve.",
    "key_learnings": [
      "Can Rampage find a way to extract maximum value with the nuts?\nPoker players that will often cold call 3-bets will generally have a strong but non nutted range",
      "Against this type of range you should proceed cautiously on a wide variety of flops but also be aware of players that will play very passively postflop"
    ],
    "position_info": "UTG+2 with pocket queens and Bones cold-calls on the button with pocket jacks. Hanson also decides t",
    "stack_sizes": "Stack sizes not specified",
    "pot_size": "Pot size not specified"
  },
  {
    "episode_number": 555,
    "title": "WPH #555: How Did He Do THAT???",
    "url": "https://jonathanlittlepoker.com/wph-555/",
    "situation": "Generally when you choose to make a continuation bet in multi-way pots you should always be looking to use smaller bet sizes. In tournament poker when you are the biggest effective stack involved in the hand, you want to bet more frequently using a smaller size.",
    "action_sequence": [
      "Brock Wilson raises to 35,000 from the lojack with pocket kings and David Coleman calls from the cutoff with AQ of spades. David Peters defends his big blind with A8o and they head to the",
      "💸 Flop – Js 4s 3c:Peters checks the flop with just an overcard and a backdoor wheel draw. Wilson bets 35,000 with his overpair and a backdoor flush draw. Coleman calls in position with two overcards, the nut flush draw, a backdoor wheel draw, and a backdoor broadway straight draw. Peters folds and t",
      "Generally when you choose to make a continuation bet in multi-way pots you should always be looking to use smaller bet sizes. In tournament poker when you are the biggest effective stack involved in the hand, you want to bet more frequently using a smaller size.\nDavid Coleman is a professional poker",
      "Generally when you choose to make a continuation bet in multi-way pots you should always be looking to use smaller bet sizes. In tournament poker when you are the biggest effective stack involved in the hand, you want to bet more frequently using a smaller size.\nDavid Coleman is a professional poker"
    ],
    "strategic_analysis": "Generally when you choose to make a continuation bet in multi-way pots you should always be looking to use smaller bet sizes. In tournament poker when you are the biggest effective stack involved in the hand, you want to bet more frequently using a smaller size.",
    "key_learnings": [
      "Will Wilson be able to use his years of poker experience to make the correct laydown?\nGenerally when you choose to make a continuation bet in multi-way pots you should always be looking to use smaller bet sizes"
    ],
    "position_info": "mpletes the flush, giving Coleman the nuts and leaving Wilson drawing dead with his pocket kings. Af",
    "stack_sizes": "effective stack involved in the hand, you want to bet more frequently using a smaller size.",
    "pot_size": "Pot size not specified"
  },
  {
    "episode_number": 556,
    "title": "WPH #556: The NEW Pocket ACES for Brad Owen!",
    "url": "https://jonathanlittlepoker.com/wph-556/",
    "situation": "While playing a cash game at the Lodge Card Club in Texas, Brad Owen found himself up against co-owner Doug Polk and other Lodge Poker regulars. In this particular poker hand, Brad reaches the river with just ace-high in a 3-bet pot and decides to fire a huge bet as a bluff. Will his opponent, Patch",
    "action_sequence": [
      "3-bettor and the",
      "🔍 Preflop:With the $20 straddle on, a player in the hijack calls before Doug Polk limps in from the cutoff. Patches raises to $100 from the button with an unknown poker hand and Brad Owen decides to 3-bet from the small blind to $425 with the solver approved poker hand, A5 of clubs. The initial limp",
      "💣 Turn – Js:The jack of spades on the turn brings a backdoor flush draw. Brad doesn’t improve and decides to slow down by checking. Patches checks back and they head to the",
      "If you are the preflop 3-bettor and the flop is uncoordinated – such as a high card with two low cards – it’s generally a good strategy to continuation bet at a high frequency using a small bet size. In these situations, your opponent will often miss the flop, and a small bet can achieve the same re",
      "In these situations, your opponent will often miss the flop, and a small bet can achieve the same result in generating folds as a larger bet would",
      "🔍 Preflop:With the $20 straddle on, a player in the hijack calls before Doug Polk limps in from the cutoff",
      "Patches raises to $100 from the button with an unknown poker hand and Brad Owen decides to 3-bet from the small blind to $425 with the solver approved poker hand, A5 of clubs",
      "The initial limper and Polk fold, but Patches calls in position to see the flop",
      "Patches calls and they head to the turn",
      "Patches checks back and they head to the river"
    ],
    "strategic_analysis": "If you are the preflop 3-bettor and the flop is uncoordinated – such as a high card with two low cards – it’s generally a good strategy to continuation bet at a high frequency using a small bet size. In these situations, your opponent will often miss the flop, and a small bet can achieve the same result in generating folds as a larger bet would.",
    "key_learnings": [
      "In this particular poker hand, Brad reaches the river with just ace-high in a 3-bet pot and decides to fire a huge bet as a bluff",
      "The initial limper and Polk fold, but Patches calls in position to see the flop",
      "Will his audacious bluff get through, or will Patches sniff it out and scoop some Bradley dollars?\nJonathan Little analyzes live poker hands from TV poker shows such as Poker After Dark, Hustler Casino Live, The Lodge Poker Club & PokerGO"
    ],
    "position_info": "mps in from the cutoff. Patches raises to $100 from the button with an unknown poker hand and Brad O",
    "stack_sizes": "Stack sizes not specified",
    "pot_size": "Pot size not specified"
  },
  {
    "episode_number": 557,
    "title": "WPH #557: Jungleman On MEGA TILT [Tony G Is RUTHLESS!]",
    "url": "https://jonathanlittlepoker.com/wph-557/",
    "situation": "Tony G is a master at getting under his opponents’ skin and sending them on mega tilt. During a huge high-stakes cash game at the Triton Poker Montenegro Series, Tony G flops trips against Dan Cates’ pocket aces. However, can Tony G talk his way to stack the professional poker player and send him on",
    "action_sequence": [
      "With the €8,000 straddle on, Dan Cates raises to €20,000 from the hijack with pocket aces. The cutoff, button and small blind fold but Tony G calls from the big blind with 54 of clubs as the two of them head to the",
      "When you have an overpair to the board on the flop, your decision to play it aggressively or passively should depend on how high your overpair is. Generally, the lower your overpair is, the more inclined you should be to play aggressively, as it is less likely to remain an overpair by the",
      "🌊",
      "Antanas Guoga or, more commonly known as Tony G is a Lithuanian-Australian businessman and also a part-time professional poker player. Tony G has played on many live poker streams throughout the years such as: Poker After Dark, High Stakes Poker, The Big Game, and many more. He is known for his thea"
    ],
    "strategic_analysis": "When you have an overpair to the board on the flop, your decision to play it aggressively or passively should depend on how high your overpair is. Generally, the lower your overpair is, the more inclined you should be to play aggressively, as it is less likely to remain an overpair by the river and requires more protection.",
    "key_learnings": [
      "Generally, the lower your overpair is, the more inclined you should be to play aggressively, as it is less likely to remain an overpair by the river and requires more protection"
    ],
    "position_info": "epend on how high your overpair is. Generally, the lower your overpair is, the more inclined you sho",
    "stack_sizes": "Stack sizes not specified",
    "pot_size": "Pot size not specified"
  },
  {
    "episode_number": 558,
    "title": "WPH #558: Is This The END For Mariano???",
    "url": "https://jonathanlittlepoker.com/wph-558/",
    "situation": "The Lodge Live stream always delivers to its audience a tonne of crazy high stakes poker action. That was no different in this poker hand as popular poker vlogger Mariano and crazy businessman Taras face off against each other. It seems like a relatively innocuous hand until Mariano check-raises the",
    "action_sequence": [
      "With the $200 straddle on, Mariano raises to $500 from under-the-gun+1 with big slick. Taras 3-bets to $1,500 from the cutoff with QJ of diamonds, and Mariano just calls with ace-king instead of opting for a 4-bet.\n💸",
      "Taras Bobrovytsky is an amateur poker player living in Texas. He has been a regular at The Lodge for a long time and will play stakes from $5/$10 all the way up to $400/$800. He is known to be very talkative at the table. Since 2022, Taras has played over 24 live streamed cash games and has won over",
      "Taras Bobrovytsky is an amateur poker player living in Texas. He has been a regular at The Lodge for a long time and will play stakes from $5/$10 all the way up to $400/$800. He is known to be very talkative at the table. Since 2022, Taras has played over 24 live streamed cash games and has won over",
      "When bluffing, making a small flop bet in relation to the size of the pot encourages your opponent to stick around with poker hands like overcards, gutshots, and backdoor draws. As a result, double barreling becomes a much more lucrative play. On relatively blank turns, you can force your opponent t",
      "It seems like a relatively innocuous hand until Mariano check-raises the river with top-top",
      "🔍 Preflop:With the $200 straddle on, Mariano raises to $500 from under-the-gun+1 with big slick",
      "Taras 3-bets to $1,500 from the cutoff with QJ of diamonds, and Mariano just calls with ace-king instead of opting for a 4-bet",
      "Mariano checks, and Taras makes a continuation bet for $1,000 with just two overs and a backdoor straight draw"
    ],
    "strategic_analysis": "When bluffing, making a small flop bet in relation to the size of the pot encourages your opponent to stick around with poker hands like overcards, gutshots, and backdoor draws. As a result, double barreling becomes a much more lucrative play. On relatively blank turns, you can force your opponent to fold hands that currently beat yours, and it also makes your overcard outs much cleaner when you hit them on the river.",
    "key_learnings": [
      "The Lodge Live stream always delivers to its audience a tonne of crazy high stakes poker action"
    ],
    "position_info": "epresent the king by firing a bet of $2,400. Mariano, however, decides to go for more value as he de",
    "stack_sizes": "Stack sizes not specified",
    "pot_size": "Pot size not specified"
  },
  {
    "episode_number": 559,
    "title": "WPH #559: Brad Owen Is In SHOCK!!!!!!!!!",
    "url": "https://jonathanlittlepoker.com/wph-559/",
    "situation": "Whether they won or lost, every poker player will remember the biggest pot of their life! When poker vlogger Brad Owen sat down at a high stakes cash game in the Bellagio poker room, he knew he might encounter the largest pot of his poker career – though he probably didn’t expect it to be with queen",
    "action_sequence": [
      "Brad Owen raises to $120 from the hijack with Q6 of spades and the villain on the button calls with J2 of spades. After both blinds fold, they both head to the",
      "The Bellagio poker room is a stylish 7,000 square feet space that houses 40 tables and two high-limit areas, the most prominent of which is the Legends Room – an exclusive two-table enclave named to honor poker’s greatest players. This room was previously known as Bobby’s room, named after the legen",
      "💣 Turn – 8s:The flush completing 8 of spades on the turn is perfect for Brad, as both players improve to a flush. Brad’s queen-high flush leaves his opponent drawing dead. Brad checks and his opponent fires another bet, this time for $1,300. Brad chooses to slow-play and just calls.\n🌊",
      "When playing deep stacked poker, you should generally continuation bet less often from out of position as being in position provides a huge advantage. However, in live poker, where flop raises are less frequent and ranges tend to be wider, continuation betting from out of position often becomes a mo",
      "However, in live poker, where flop raises are less frequent and ranges tend to be wider, continuation betting from out of position often becomes a more viable poker strategy",
      "🔍 Preflop:Brad Owen raises to $120 from the hijack with Q6 of spades and the villain on the button calls with J2 of spades",
      "Brad calls and they head to the turn",
      "Brad checks and his opponent fires another bet, this time for $1,300",
      "Brad chooses to slow-play and just calls"
    ],
    "strategic_analysis": "When playing deep stacked poker, you should generally continuation bet less often from out of position as being in position provides a huge advantage. However, in live poker, where flop raises are less frequent and ranges tend to be wider, continuation betting from out of position often becomes a more viable poker strategy.",
    "key_learnings": [
      "Will he win or lose this unforgettable poker hand? Whatever happens it is certain that Brad Owen is in shock at the outcome of this hand!\nWhen playing deep stacked poker, you should generally continuation bet less often from out of position as being in position provides a huge advantage"
    ],
    "position_info": "ep stacked poker, you should generally continuation bet less often from out of position as being in ",
    "stack_sizes": "Stack sizes not specified",
    "pot_size": "Pot size not specified"
  },
  {
    "episode_number": 560,
    "title": "WPH #560: How DIRTY Is THIS??????",
    "url": "https://jonathanlittlepoker.com/wph-560/",
    "situation": "During a $125,000 buy-in high stakes poker tournament at the 2024 Triton Poker Series Montenegro. Alex Kulev’s dreams come true when he gets dealt pocket aces on his first hand at the table and PokerCoaching.com coach Chris Brewer decides to 4-bet him. But by the river, Kulev’s pocket rockets are no",
    "action_sequence": [
      ". Aces play better as a trap pre",
      "Chris Brewer is an American professional poker player. He has over $25,100,000 in live tournament earnings putting him in the top 40 on the all-time money list. He has 2 World Series of Poker (WSOP) bracelets, one of which came from the 2023 $250,000 buy-in event for $5,293,556. He is also a PokerCo",
      "🌊",
      "When playing a game theory optimal (GTO) strategy with a very deep stack in tournament poker, pocket aces should rarely be part of your 5-betting range preflop. Aces play better as a trap preflop, therefore you should include them into your 4-bet calling range instead. A hand like pocket kings shoul"
    ],
    "strategic_analysis": "When playing a game theory optimal (GTO) strategy with a very deep stack in tournament poker, pocket aces should rarely be part of your 5-betting range preflop. Aces play better as a trap preflop, therefore you should include them into your 4-bet calling range instead. A hand like pocket kings should fall into your 5-bet for value range, while ace-five suited is typically used as a 5-bet bluff.",
    "key_learnings": [
      "Aces play better as a trap preflop, therefore you should include them into your 4-bet calling range instead"
    ],
    "position_info": "ep stack in tournament poker, pocket aces should rarely be part of your 5-betting range preflop. Ace",
    "stack_sizes": "Stack sizes not specified",
    "pot_size": "Pot size not specified"
  }
]