{
  "scrape_date": "2025-09-04 07:29:30",
  "total_hands": 10,
  "episodes": [
    550,
    551,
    552,
    553,
    555,
    556,
    557,
    558,
    559,
    565
  ],
  "titles": [
    "Episode 550: WPH #554: He STUNS Everyone!!!!!!",
    "Episode 551: WPH #551: She’s The NEW QUEEN of Poker!!",
    "Episode 552: WPH #552: Did Andrew Neeme Just Get OWNED????",
    "Episode 553: WPH #553: Rampage Poker Is So LUCKY!!!!!!",
    "Episode 555: WPH #555: How Did He Do THAT???",
    "Episode 556: WPH #556: The NEW Pocket ACES for Brad Owen!",
    "Episode 557: WPH #557: Jungleman On MEGA TILT [Tony G Is RUTHLESS!]",
    "Episode 558: WPH #558: Is This The END For Mariano???",
    "Episode 559: WPH #559: Brad Owen Is In SHOCK!!!!!!!!!",
    "Episode 565: WPH #565: This Is An INSANE Hand! [Mariano Is SHOCKED]"
  ],
  "sample_hand": {
    "episode_number": 550,
    "title": "WPH #554: He STUNS Everyone!!!!!!",
    "url": "https://jonathanlittlepoker.com/wph-550/",
    "situation": "Lukas Robinson “RobinPoker” is a professional poker player from England. He has over $58,000 in live tournament earnings. He is known for being the first PokerNews ambassador, a role that sees him streaming online poker on Twitch. He rose to fame in 2021 when he became the first poker player to stre",
    "action_sequence": [
      "Lukas Robinson raises from the cutoff to 50,000 with A5o. After the button and small blind fold, Maria Ho defends her big blind with A4 of hearts and the two professional poker players head to the",
      "💸 Flop – Ac Ts 6d:With her suited wheel-ace, Ho flops top pair with no backdoor draws. She checks, to which Robinson fires a continuation bet of 40,000 with the same top pair. Ho decides not to raise and just calls as they head to the",
      "💣 Turn – Tc:Ho checks again when the board-pairing ten of clubs arrives on the turn. Robinson correctly realizes this card is better for Ho’s range than his, so he chooses to do some pot control and checks behind.\n🌊",
      "When you have a weak top pair and you are out of position, it’s generally not advised to start check-raising and putting a lot of money in the pot. TMost of the time, you are either way ahead and you do not need to worry about being outdrawn, or you’re way behind and have very few outs to make the w"
    ],
    "strategic_analysis": "When you have a weak top pair and you are out of position, it’s generally not advised to start check-raising and putting a lot of money in the pot. TMost of the time, you are either way ahead and you do not need to worry about being outdrawn, or you’re way behind and have very few outs to make the winning hand.",
    "key_learnings": [
      "He has what feels like a relatively easy call, but will the nerves get to him?\nWhen you have a weak top pair and you are out of position, it’s generally not advised to start check-raising and putting a lot of money in the pot"
    ],
    "position_info": "episodes, the sixteen participants competed across various poker formats, including Sit & Go’s, Head",
    "stack_sizes": "Stack sizes not specified",
    "pot_size": "Pot size not specified"
  }
}